GHB2/src/Enums/гхб_СтатусыКонсервацииПомещений/гхб_СтатусыКонсервацииПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_СтатусыКонсервацииПомещений</name>
  <enumValues>
    <name>Green</name>
  </enumValues>
  <enumValues>
    <name>Yellow</name>
  </enumValues>
  <enumValues>
    <name>Red</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Enums/гхб_СтатусыКонсервацииПомещений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьЦветСтатуса(_СтатусКонсервации) Экспорт 
	
	_Цвет = WebЦвета.Белый;
	
	Если _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Red Тогда
		_Цвет = WebЦвета.Розовый; // FFC0CB
	ИначеЕсли _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Yellow Тогда
		_Цвет = WebЦвета.СветлоЗолотистый; // FFEC8B
	ИначеЕсли _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Green Тогда
		_Цвет = WebЦвета.НейтральноЗеленый; // C0DCC0
	КонецЕсли;	
	
	Возврат _Цвет;
	
КонецФункции

Функция ВернутьЦветСтатусаHTML(_СтатусКонсервации) Экспорт 
	
	_Цвет = "FFFFFF";
	
	Если _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Red Тогда
		_Цвет = "FFC0CB";
	ИначеЕсли _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Yellow Тогда
		_Цвет = "FFEC8B";
	ИначеЕсли _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Green Тогда
		_Цвет = "C0DCC0";
	КонецЕсли;	
	
	Возврат _Цвет;
	
КонецФункции

Функция ВернутьКраткоеИмяСтатуса(_СтатусКонсервации) Экспорт 
	
	_Имя = "";
	
	Если _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Red Тогда
		_Имя = "R";
	ИначеЕсли _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Yellow Тогда
		_Имя = "Y";
	ИначеЕсли _СтатусКонсервации = Перечисления.гхб_СтатусыКонсервацииПомещений.Green Тогда
		_Имя = "G";
	КонецЕсли;	
	
	Возврат _Имя;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
